Repository: OpenModelica/OMCompiler
Catalog: Compiler/Translation/*.po
Languages: sv

source: OMC unable to load `%s': %s.
sv: OMC kunde inte ladda `%s': %s.

source: Modelica URI lacks classname: %s
sv: Modelica URI saknar klassnamn: %s

source: File URI has no path: %s
sv: File URI saknar sökväg: %s

source: File URI using hostnames is not supported: %s
sv: File URI med värdnamn stöds inte: %s

source: Unknown uri: %s
sv: Okänd uri: %s

source: freopen(%s,%s,%s) failed: %s
sv: freopen(%s,%s,%s) misslyckades: %s

source: iconv("%s",to="%s",from="%s") failed: %s
sv: iconv("%s",to="%s",from="%s") misslyckades: %s

source: iconv(to=%s) failed because the character set output null bytes in the middle of the string.
sv: iconv(to=%s) misslyckades eftersom teckenuppsättningen använde en noll-byte mitt i strängen.

source: Warning: Failed to set locale: '%s'
sv: Varning: Misslyckades sätta nationella inställningar: '%s'

source: Warning: Failed to set LC_CTYPE to UTF-8 using the chosen locale and C.UTF-8. OpenModelica assumes all input and output it makes is in UTF-8 so you might have some issues.
sv: Varning: Misslyckades sätta LC_CTYPE till UTF-8 med de valda nationella inställningarna och C.UTF-8. OpenModelica antar att all in- och utdata är kodad som UTF-8 så du kan få smärre problem.

source: Could not access file %s: %s.
sv: Kunde inte få åtkomst till filen %s: %s.
