Repository: OpenModelica/OMCompiler
Catalog: Compiler/Translation/*.po
Languages: sv

source: Failed to evaluate function: %s.
sv: Misslyckades evaluera funktion: %s.

source: Trying to override final variable in component %s and scope %s by using modifiers: %s and %s that do not agree.
sv: Försöker överskrida slutgiltig variabel i komponent %s och definitionsområde %s med modifikationer: %s och %s some inte stämmer överens.

source: In component %s, in relation %s, %s on Real numbers is only allowed inside functions.
sv: I komponent %s, i relation %s, %s på värden av typ Real är endast tillåtet inuti funktioner.

source: Ignoring the modification on outer element: %s.
sv: Ignorerar modifikationen på ett yttre element: %s.

source: In modifier %s.
sv: I modifierare %s.

source: Multiple modifiers in same scope for element %s, %s.
sv: Flera modifikationer i samma definitionsområde för element %s, %s.

source: The system of units is inconsistent in term %s with the units %s and %s respectively.
sv: Systemet av enheter är inkonsistent i term %s med enheter %s och %s respektive.

source: The system of units is consistent.
sv: Systemet av enheter är konsistent.

source: The system of units is incomplete. Please provide unit information to the model by e.g. using types from the SIunits package.
sv: Systemet av enheter är ofullständigt. Ange enhetsinformation till modellen genom att t.ex. använda typer från paketet SIunits.

source: Failed to elaborate rhs of %s.
sv: Kunde inte utveckla högerledet i %s.

source: Could not evaluate expression: %s
sv: Kunde inte evaluera uttryck: %s

source: Jacobian equation %s could not solve proper for %s. Assume %s=0.
sv: Jacobian-ekvation %s kunde inte göra en ordentlig lösning för %s. Förutsätter %s=0.

source: Simplification produced a higher complexity (%s) than the original (%s). The simplification was: %s => %s.
sv: Förenkling resulterade i en högre komplexitet (%s) än originalet (%s). Förenklingen var: %s => %s.

source: Cannot instantiate %s due to class specialization %s.
sv: Kan inte instansiera %s på grund av klass-specialisering %s.

source: Library %s was not loaded but is marked as used by model %s.
sv: Bibliotek %s laddades inte men modell %s har markerat att den använder biblioteket.

source: The maximum recursion depth of %s was reached, probably due to mutual recursion. The current scope: %s.
sv: Maximalt rekursiondjup på %s uppnåddes, förmodligen på grund av ömsesidig rekursion. Nuvarande definitionsområde: %s.

source: The model requires derivatives of some inputs as listed below: %s
sv: Modellen kräver derivator av följande input-variabler: %s

source: The compiler was sent command-line arguments that were not UTF-8 encoded and will abort the current execution.
sv: Kompilatorn fick kommandoradsargument some inte var UTF-8-kodade och kommer att avbryta exekveringen.

source: The package.order file does not list all .mo files and directories (containing package.mo) present in its directory. Missing names are: %s
sv: package.order-filen listar inte alla mo-filer och kataloger (som innehåller package.mo) närvarande i sin katalog. Saknade namn är: \t%s

source: Using reinit in when with condition initial() is not allowed. Use assignment or equality equation instead.
sv: Det är ej tillåtet att använda reinit i when med initial()-villkor. Använd tilldelning eller en ekvation istället.

source: No corresponding 'inner' declaration found for class %s declared as '%s'. Continuing flattening by only considering the 'outer' class declaration.
sv: Ingen motsvarande 'inner'-deklaration hittades för klass %s deklareras som '%s'. Fortsätter utflatningen genom att enbart ta hänsyn till 'outer'-deklarationen.

source: The maximum recursion depth of %s was reached when evaluating expression %s in scope %s. Translation may still succeed but you are recommended to fix the problem.
sv: Maximalt rekursiondjup på %s uppnåddes under evaluering av uttrycket %s i definitionsområde %s. Översättningen kan fortfarande lyckas men du rekommenderas fixa problemet.

source: The maximum recursion depth of %s was reached when instantiating a derived class. Current class %s in scope %s.
sv: Maximalt rekursiondjup på %s uppnåddes under instansiering av en härledd klass. Nuvarande klass %s i definitionsområde %s.

source: OpenModelica requires that all external objects input arguments are possible to evaluate before initialization in order to avoid odd run-time failures, but %s is a variable.
sv: OpenModelica kräver att alla externa objekts input-argument går att evaluera före initiering för att undvika konstiga körtidsfel, men %s är en variabel.

source: Could not find class annotation %s in class %s.
sv: Kunde inte hitta klassannotationen %s i klass %s.

source: Failed to compile all functions in package %s.
sv: Misslyckades att kompilera alla funktioner i paketet %s.

source: The operator scalar requires all dimension size to be 1, but the input has type %s.
sv: Operatorn scalar kräver att alla dimensioner är av storlek 1, men argumentet har typ %s.

source: classDirectory() is a non-standard operator that was replaced by Modelica.Utilities.Files.loadResource(uri) before it was added to the language specification.
sv: classDirectory() är en icke-standard operator som ersattes av Modelica.Utilities.Files.loadResource(uri) innan den lades till i språkspecifikationen.

source: The same class is defined in multiple files: %s.
sv: Samma klass är definierad i flera filer: %s.

source: Integer (%s) to enumeration (%s) conversion is not valid Modelica, please use enumeration constant (%s) instead.
sv: Konvertering av Integer (%s) till enumeration (%s) är inte giltig Modelica, var god använd enumeration-konstant (%s) istället.

source: The Integer to %s conversion failed, as the Integer %s is outside the range (1, ..., %s) of values corresponding to enumeration constants.
sv: Konvertering av Integer till %s misslyckades, eftersom heltalet %s är utanför intervallet (1, ..., %s) av värden som motsvarar enumeration-konstanter.

source: The Integer (%s) to enumeration conversion failed because information about the the enumeration type is missing.
sv: Konverteringen av Integer (%s) till enumeration misslyckades eftersom information om enumeration-typen saknas.

source: Expression %s is not a valid statement - only function calls are allowed.
sv: Uttrycket %s är inte ett giltigt uttryck - endast funktionsanrop är tillåtna.

source: Invalid type of flag %s, expected one of %s but got %s.
sv: Ogiltig typ av flagga %s, förväntade %s men fick %s.

source: Function %s returns an external object, but the only function allowed to return this object is %s.
sv: Funktionen %s returnerar ett externt objekt, men den enda funktionen som får returnera detta objekt är %s.

source: Usage of non-standard operator (not specified in the Modelica specification): %s. Functionality might be partially supported but is not guaranteed.
sv: Användning av icke-standard operator (ej i Modelicas specifikation): %s. Funktionaliteten kan vara delvis implementerad, men garanteras ej.

source: Ignoring connection of array components having size zero: %s and %s.
sv: Ignorerar anslutning av vektorkomponenter av storlek noll: %s och %s.

source: Ignoring record component: %swhen building record the constructor. Records are allowed to contain only components of basic types, arrays of basic types or other records.
sv: Ignorerar record-komponent: %svid generering av konstructor. Ett record får endast innehålla komponenter av grundtyp, vektor av grundtyp, eller recordtyp.

source: Found equation without time-dependent variables: %s = %s
sv: Hittade ekvation utan tidsberoende variabler: %s = %s

source: Local variable '%s' shadows another variable.
sv: Lokal variabel '%s' skuggar en annan variabel.

source: %s uses invalid subtypeof syntax. Only subtypeof Any is supported.
sv: %s använder ogiltig subtypeof syntax. Endast subtypeof Any stöds.

source: %s is used as a function reference, but doesn't specify the partial prefix.
sv: %s används som en funktionsreferens, men specificerar inte prefixet 'partial'.

source: Match expression equation sections forbid the use of %s-equations.
sv: Ekvations-sektioner i match-uttryck förbjuder användandet av %s-ekvationer.

source: Uniontype %s was not generated correctly. One possible cause is modifications, which are not allowed.
sv: Unionstyp %s skapades inte korrekt. En möjlig förklaring är modifikationer, som inte tillåts.

source: MetaModelica complex types may not have modifiers.
sv: Komplexa typer i MetaModelica får inte ha modifikationer.

source: Cannot evaluate function pointers (got %s).
sv: Kan inte evaluera funktionspekare (fick %s).

source: Tried to use function %s, but it was not instantiated.
sv: Försökte använda funktion %s, men den var inte instansierad.

source: Could not solve the polymorphism in the function call to %s Input bindings: %s Solved bindings: %s Unsolved bindings: %s
sv: Kunde inte lösa polymorft funktionsanrop till %s In-bindningar: %s Lösta bindningar: %s Olösta bindningar: %s

source: In record constructor %s: %s
sv: I metarecordanrop %s: %s

source: Invalid pattern: %s
sv: Ogiltigt mönster: %s

source: Failed to elaborate match expression %s
sv: Kunde inte utveckla matchuttryck %s

source: Failed to match types of cons expression %s. The head has type %s and the tail %s.
sv: Kunde inte matcha typer i cons-uttryck %s. Huvudet har typen %s och svansen %s.

source: NONE is not acceptable syntax. Use NONE() instead.
sv: NONE är inte acceptabel syntax. Använd NONE() istället.

source: Invalid named fields: %s. Valid field names: %s.
sv: Ogiltiga namngivna fält: %s. Giltiga fältnamn: %s.

source: Only components without direction are allowed in local declarations, got: %s
sv: Endast komponenter utan riktning får användas i lokala deklarationer, fick: %s

source: Invalid complex type name: %s
sv: Ogiltigt namn på komplex typ: %s

source: In pattern %s: %s is not part of uniontype %s
sv: I mönster %s: %s är inte en del av unionstyp %s

source: Type mismatch in pattern %s expression type: %s pattern type: %s
sv: Typfel i mönster %s faktisk typ: %s förväntad typ: %s

source: Call pattern is not a record constructor %s
sv: Anropsmönster är inte en record-konstruktor %s

source: Match expression has mismatched result types:%s
sv: Match-uttryck har resultattyper som inte stämmer överens:%s

source: This matchcontinue expression has no overlapping patterns and should be using match instead of matchcontinue.
sv: Detta matchcontinue-uttryck saknar överlappande mönster och borde använda match istället för matchcontinue.

source: Dead code elimination: %s.
sv: Eliminering av död kod: %s.

source: Unused local variable: %s.
sv: Oanvänd lokal variabel: %s.

source: Removing unused as-binding: %s.
sv: Tar bort oanvänd as-bindning: %s.

source: Converted match expression to switch of type %s.
sv: Omvandlade matchuttryck till switchuttryck av typ %s.

source: Reductions require the types of the %s and %s to be %s, but got: %s and %s.
sv: Reduktioner kräver att typerna av %s och %s är %s, men fick %s och %s.

source: Expected a reduction function with type signature ('A,'B) => 'B, but got %s.
sv: Förväntade en reduktionsfunktion med typsignatur ('A,'B) => 'B, men fick %s.

source: Operator %s expects numeric types as operands, but got '%s and %s'.
sv: Operator %s förväntar sig numeriska typer som operander, men fick '%s' och '%s'.

source: Could not evaluate structural parameter (or constant): %s which gives dimensions of array: %s. Array dimensions must be known at compile time.
sv: Kunde inte evaluera strukturell parameter (eller konstant): %s som bestämmer dimensioner av en array: %s. Array-dimensioner måste vara kända vid kompilering.

source: Removing unused assignment to: %s.
sv: Tar bort oanvänd tilldelning till: %s.

source: Template error: %s
sv: Template-fel: %s

source: Operator Overloading: %s.
sv: Operatoröverlagring: %s.

source: File not Found: %s.
sv: Filen hittades inte: %s.

source: Unknown FMU version %s. Only version 1.0 & 2.0 are supported.
sv: Okänd FMU-version %s. Endast version 1.0 och 2.0 stöds.

source: Sets whether to print a failtrace or not.
sv: Anger om en failtrace ska skrivas ut eller inte.

source: Prints extra information from Ceval.
sv: Skriv ut extra information från Ceval.

source: Do some simple analyses on the datastructure from the frontend to check if it is consistent.
sv: Gör enkla analyser på datastrukturen från framändan för att se om den är konsistent.

source: Experimental: Enable parallelization of independent systems of equations in the translated model.
sv: Experimentell: Slår på parallellisering av oberoende system av ekvationer i den översatta modellen.

source: Experimental: Unused parallelization.
sv: Experimentell: Oanvänd parallellisering.

source: Turns on/off events handling.
sv: Slår på/av händelsehantering.

source: Dumps the inline solver equation system.
sv: Skriver ut ekvationssystemet från inline-lösaren.

source: Turns on/off symbolic function evaluation.
sv: Slår på/av symbolisk funktionsevaluering.

source: Turns on/off dynamic loading of functions that are compiled during translation. Only enable this if external functions are needed to calculate structural parameters or constants.
sv: Slår på/av dynamisk laddning av funkioner som kompileras under översättningen. Slå endast på detta om externa funktioner behövs för att beräkna strukturella parametrar eller konstanter.

source: Display debug information about dynamic loading of compiled functions.
sv: Visar debug-information angående dynamisk laddning av kompilerade funktioner.

source: Used to generate code for the bootstrapped compiler.
sv: Används för att generera kod för den bootstrappade kompilatorn.

source: Generates a graphviz file of the connection graph.
sv: Skapar en graphviz-fil av kopplingsgrafen.

source: Displays the connection graph with the GraphViz lefty tool.
sv: Visar kopplingsgrafen med GraphViz-verktyget lefty.

source: Enables extra type checking for cref expressions.
sv: Slår på extra typkontrol för cref-uttryck.

source: Prints out a warning if an ASUB is created from a CREF expression.
sv: Skriver ut en varning om en ASUB skapas från ett CREF-uttryck.

source: Prints extra failtrace from InstanceHierarchy.
sv: Skriver ut extra failtrace från InstanceHierarchy.

source: Turns off the instantiation cache.
sv: Slå av instansieringscachen.

source: Converts Modelica-style arrays to lists.
sv: Konverterar vektorer i Modelica-stil till listor.

source: Prints out a notification if tail recursion optimization has been applied.
sv: Skriver ut en notis då optimeringen svansrekursion används.

source: Print extra failtrace from lookup.
sv: Skriver ut extra failtrace från lookup.

source: Adds notifications of all pattern-matching optimizations that are performed.
sv: Visar meddelanden för alla mönstermatchningsoptimeringar som utförs.

source: Performs dead code elimination in match-expressions.
sv: Utför eliminering av död kod i match-uttryck.

source: Optimization that moves the last assignment(s) into the result of a match-expression. For example: equation c = fn(b); then c; => then fn(b);
sv: Optimering som flyttar den sista tilldelningen till resultatet av match-uttrycket. Till exempel:equation c = fn(b); then c; => then fn(b);

source: Turns on custom reduction functions (OpenModelica extension).
sv: Slår på egna reduktionsfunktioner (OpenModelica-tillägg).

source: Constant evaluates parameters if set.
sv: Slår på konstantevaluering av parametrar.

source: Prints extra failtrace from Types.
sv: Skriver ut extra failtrace från Types.

source: Shows the statement that is currently being evaluated when evaluating a script.
sv: Visar den sats som håller på att evalueras då ett script körs.

source: Dumps the absyn representation of a program.
sv: Skriver ut absyn-representationen av ett program.

source: Dumps the absyn representation of a program in graphviz format.
sv: Skriver ut absyn-representationen av ett program i graphviz-format.

source: Prints out execution statistics for the compiler.
sv: Skriver ut exekveringsstatistik för kompilatorn.

source: Applies transformations required for code generation before dumping flat code.
sv: Tillämpar transformationer som krävs för kodgenerering före utskrift av utplattat kod.

source: Dumps the DAE in graphviz format.
sv: Skriver ut DAEn i graphviz-format.

source: Starts omc as a server listening on the socket interface.
sv: Startar omc som en server som lyssnar på socket-gränssnittet.

source: Starts omc as a server listening on the Corba interface.
sv: Startar omc som en server som lyssnar på Corba-gränssnittet.

source: Prints out debug information for the interactive server.
sv: Skriver ut debug-information för den interaktiva servern.

source: Dump the found replacements for simple equation removal.
sv: Skriver ut funna ersättningar för remove simple equation.

source: Dump the found replacements for final parameters.
sv: Skriver ut funna ersättningar för final-parametrar.

source: Dump the found replacements for remove parameters.
sv: Skriver ut funna ersättningar för bortplockade parametrar.

source: Dump the found replacements for protected parameters.
sv: Skriver ut funna ersättningar för skyddade parametrar.

source: Dump the found replacements for evaluate annotations (evaluate=true) parameters.
sv: Skriver ut funna ersättningar för evalueringsannotationer (evaluate=true) parametrar.

source: Dump the found alias variables.
sv: Skriver ut funna aliasvariabler.

source: Dumps tearing information.
sv: Skriver ut information från tearing.

source: Dumps information about symbolic Jacobians. Can be used only with postOptModules: generateSymbolicJacobian, generateSymbolicLinearization.
sv: Skriver ut information om symboliska jacobianer. Kan endast användas med postOptModules: generateSymbolicJacobian, generateSymbolicLinerization.

source: Dumps information in verbose mode about symbolic Jacobians. Can be used only with postOptModules: generateSymbolicJacobian, generateSymbolicLinearization.
sv: Skriver ut utförlig information om symboliska jacobianer. Kan endast användas med postOptModules: generateSymbolicJacobian, generateSymbolLinearization.

source: Dump for debug purpose of symbolic Jacobians. (deactivated now).
sv: Slår på debugutskrift för symboliska jacobianer (inaktiverad).

source: Prints warnings regarding symoblic jacbians.
sv: Skriver ut varnings angående symboliska jacobianer.

source: Dumps sparse pattern with coloring used for simulation.
sv: Skriver ut glest mönster med färgning som används för simulering.

source: Dumps in verbose mode sparse pattern with coloring used for simulation.
sv: Skriver utförligt ut glest mönster med färgning som används för simulering.

source: Dumps information from index reduction.
sv: Skriver ut information från indexreduktion.

source: Dumps information from dummy state selection heuristic.
sv: Skriver ut information från heuristiken dummy state selection.

source: Dumps the equation system at the beginning of the back end.
sv: Skriver ut ekvationssystemet vid början av bakändan.

source: Dumps the equation system after index reduction and optimization.
sv: Skriver ut ekvationssystemet efter indexreduktion och optimering.

source: Dumps information from the optimization modules.
sv: Skriver ut information från optimeringsmodulerna.

source: Measures the time it takes to hash all simcode variables before code generation.
sv: Mäter tiden det tar att hasha alla simcode-variabler före kodgenerering.

source: Enables dumping of the parameters in the order they are calculated.
sv: Slår på utskrift av parametrar i den ordning de beräknas.

source: Dumps the results of the preOptModule encapsulateWhenConditions.
sv: Skriver ut resultatet från preOptModule encapsulateWhenConditions.

source: Perform O(n) relaxation.
sv: Utför O(n) relaxation.

source: Enables short output of the simulate() command. Useful for tools like OMNotebook.
sv: Slår på förkortad utskrift från simulate()-kommandot. Användbart för verktyg som OMNotebook.

source: Count operations.
sv: Räkna operationer.

source: Prints out connection graph information.
sv: Skriver ut information från kopplingsgrafen.

source: Prints information about modification updates.
sv: Skriver ut information om modifieringsuppdateringar.

source: Enables extra debug output from the static elaboration.
sv: Slår på extra debugutskrift från den statiska utvecklingen.

source: Enables output of template performance data for rendering text to file.
sv: Slår på utskrift av prestandadata för rendering av template-text till fil.

source: Enables checks for expression simplification and prints a notification whenever an undesirable transformation has been performed.
sv: Slår på kontroller för uttrycksförenkling och skriver ut en notis då oönskade omvandlingar har utförts.

source: Enables experimental SCode instantiation phase.
sv: Slår på experimentell SCode instansieringsfas.

source: Enables writing simulation results to buffer.
sv: Skriv ut simuleringsresultat till buffer.

source: Enables dumping of back-end information about system (Number of equations before back-end,...).
sv: Skriver ut information bakändan har om systemet (antal ekvationer före bakända, ...).

source: Generate code with debugging symbols.
sv: Genererar kod med debugsymboler.

source: Enables dumping of the equations in the order they are calculated.
sv: Skriv ut ekvationer i den ordning de beräknas.

source: Enables dumping of the optimization information when optimizing calls to semiLinear.
sv: Slår på utskrift av optimeringsinformation för semiLinear-anrop.

source: Enables dumping of status when calling modelEquationsUC.
sv: Slår på statusutskrift när modelEquationsUC anropas.

source: Enables dumping of the DAE startOrigin attribute of the variables.
sv: Slår på utskrift av startOrigin-attributet för variabler i DAEn.

source: Dumps the initial equation system.
sv: Förenklar tidsinitiala system.

source: Dump the found replacements for constants.
sv: Skriver ut funna ersättningar för konstanter.

source: Switch into pedantic debug-mode, to get much more feedback.
sv: Slår på pedantiskt debugläge för mer feedback.

source: Display the element source information in the dumped DAE for easier debugging.
sv: Visar källinformation för element vid utskrift av DAEn för enklare debugging.

source: Generates analytical Jacobian for non-linear algebraic loops.
sv: Genererar analytisk jacobian för icke-linjära algebraiska loopar.

source: Generates code for inline solver.
sv: Genererar kod för inline-lösare.

source: Enables parallel calculation based on task-graphs.
sv: Slår på parallell beräkning baserad på uppgiftsgrafer.

source: Shows additional information from the initialization process.
sv: Visar extra information från initieringen.

source: Controls if function inlining should be performed.
sv: Kontrollerar om inlining av funktioner ska utföras.

source: Dumps graphml files with the strongly connected components.
sv: Dumpar graphml-filer med de starkt kopplade komponenterna.

source: Dumps verbose tearing information.
sv: Skriver ut utförlig information från tearing.

source: Disables the generation of single flow equations.
sv: Stänger av genereringen av ekvationer för okopplade flow-variabler.

source: Enables output of the operations in the _info.xml file when translating models.
sv: Slår på utmatning av operationer i _info.xml-filen vid översättning av modeller.

source: Dumps additional information on the parallel execution with hpcom.
sv: Visar ytterligare information om parallell exekvering med hpcom.

source: Activates the resolveLoops module.
sv: Aktiverar resolveLoops-modulen.

source: Disables warnings on Windows if OPENMODELICAHOME/MinGW is missing.
sv: Stänger av varningar på Windows om OPENMODELICAHOME/MinGW saknas.
