Repository: OpenModelica/OMCompiler
Catalog: Compiler/Translation/*.po
Languages: sv

source: component
sv: komponent

source: inherited class
sv: ärvd klass

source: File does not exist:
sv: Filen finns inte:

source: Class %s not found in scope %s.
sv: Klass %s hittades inte i definitionsområde %s.

source: Class %s not found in scope %s while instantiating %s.
sv: Klass %s hittades inte i definitionsområde %s då %s instansierades.

source: Variable %s not found in scope %s.
sv: Variabel %s hittades inte i definitionsområde %s.

source: Trying to assign to constant component in %s := %s
sv: Försök till tilldelning av konstant komponent i %s := %s

source: Trying to assign to parameter component in %s := %s
sv: Försök till tilldelning av parameterkomponent i %s := %s

source: Trying to assign to %s component %s.
sv: Försökte göra en tilldelning till %s komponent %s.

source: Type mismatch in assignment in %s := %s of %s := %s
sv: Typfel i tilldelning %s := %s av typ %s := %s

source: Type error in conditional '%s'. Expected Boolean, got %s.
sv: Typfel i villkorligt uttryck '%s'. Förväntade Boolean, fick %s.

source: Type error in iteration range '%s'. Expected array got %s.
sv: Typfel i uttryck '%s'. Förväntade array, fick %s.

source: Type error in when conditional '%s'. Expected Boolean scalar or vector, got %s.
sv: Typfel i when-villkor '%s'. Förväntade Boolean skalär eller vektor, fick %s.

source: Type error in while conditional '%s'. Expected Boolean got %s.
sv: Typfel i while-villkor '%s'. Förväntade Boolean, fick %s.

source: 'end' can not be used outside array subscripts.
sv: 'end' kan inte användas utanför subskript av arrayer.

source: Division by zero in %s / %s
sv: Division med noll i %s / %s

source: Modulo by zero in mod(%s,%s).
sv: Modulo av noll i mod(%s,%s).

source: Second argument in rem is zero in rem(%s,%s).
sv: Andra argumentet i rem är noll i rem(%s,%s).

source: Error reading simulation result.
sv: Fel vid läsning av simuleringsresultat.

source: Extending %s is not allowed, since it is an enclosing class.
sv: Ärvning av %s är ej tillåtet, eftersom det är en omslutande klass.

source: Class %s not found.
sv: Klass %s hittades inte.

source: Error writing to file %s.
sv: Fel vid skrivning till fil %s.

source: Error building simulator. Build log: %s
sv: Fel vid bygge av simulator. Loggfil: %s

source: Dimensions must be parameter or constant expression (in %s).
sv: Dimensioner måste vara parameter- eller konstant-uttryck (i %s).

source: Variable %s has no value.
sv: Variabel %s saknar värde.

source: Negative value as argument to sqrt.
sv: Negativt värde som argument till sqrt.

source: No constant value for variable %s in scope %s.
sv: Inget konstant värde för variabel %s i definitionsområde %s.

source: In class %s, class specialization 'type' can only be derived from predefined types.
sv: I klass %s får klass-specialisering 'type' enbart komma från fördefinierade typer.

source: Cannot connect %s %s to non-constant/parameter %s.
sv: Kan inte ansluta %s %s till icke-konstant/parameter %s.

source: Connector element %s may not be both %s and %s.
sv: Kopplingselementet %s får ej vara både %s och %s.

source: %s is a composite connector element, and may not be declared as %s.
sv: %s är ett sammansatt kopplingselement, och får ej deklareras som %s.

source: Different number of equations in the branches of the if equation: %s
sv: Olika antal ekvationer i grenarna av if-ekvationen: %s

source: Too few equations, under-determined system. The model has %s equation(s) and %s variable(s).
sv: För få ekvationer, underbestämt system. Modellen har %s ekvationer och %s variabler.

source: Too many equations, over-determined system. The model has %s equation(s) and %s variable(s).
sv: För många ekvationer, överbestämt system. Modellen har %s ekvationer och %s variabler.

source: Model is structurally singular, error found sorting equations %s for variables %s
sv: Modellen är strukturellt singulär; felet hittades under sortering av ekvationerna %s för variablerna %s

source: The language feature %s is not supported. Suggested workaround: %s
sv: Språkfunktionen %s stöds ej. Förslag på lösning: %s

source: Derivative of expression %s is non-existent.
sv: Derivatan av uttrycket %s existerar ej.

source: No classes are loaded.
sv: Inga klasser är laddade.

source: Illegal to instantiate partial class %s.
sv: Förbjudet att instansiera partiell klass %s.

source: Base class %s not found in scope %s.
sv: Basklass %s hittades inte i definitionsområde %s.

source: Invalid redeclaration of %s %s as %s.
sv: Ogiltig omdeklarering av %s %s som %s.

source: Trying to redeclare %1 %2 but %1 not declared as replaceable.
sv: Försöker omdeklarera %1 %2 men %1 är ej deklarerad som replaceable.

source: Component declared as %s when having the variable %s declared as %s.
sv: Komponent deklarerad som %s när variabeln %s redan är deklarerad som %s.

source: Array dimension mismatch, expression %s has type %s, expected array dimensions [%s].
sv: Vektor-dimensioner är missanpassade, uttryck %s har typ %s, förväntade dimensioner [%s].

source: Array dimension must be integer expression in %s which has type %s.
sv: Vektor-dimension måste vara ett heltalsuttryck i %s men har typ %s.

source: Type mismatch in equation %s of type %s.
sv: Typfel i ekvation %s av typ %s.

source: Array equation has unknown size in %s.
sv: Array-ekvation har okänd storlek i %s.

source: Tuple assignment only allowed when rhs is function call (in %s).
sv: Tupel-tilldelning är endast tillåtet då högerledet är ett funktionsanrop (i %s).

source: Illegal connection: component %s is not a connector.
sv: Otillåten anslutning: komponent %s är inte en connector.

source: Cannot connect expandable connector %s with non-expandable connector %s.
sv: Kan inte ansluta expandable connector %s till icke-expandable connector %s.

source: Cannot connect undeclared connectors %s with %s. At least one of them must be declared.
sv: Kan inte ansluta odeklarerade kopplingselement %s med %s. Åtminstone en av dem måste vara deklarerad.

source: Cannot connect %1 component %2 to non-%1 component %3.
sv: Kan inte ansluta %1-komponent %2 till icke-%1-komponent %3.

source: The type of variables %s and %s are inconsistent in connect equations.
sv: Typen på variablerna %s och %s är oförenliga i anslutningsekvationen.

source: Wrong type on %s, expected %s.
sv: Fel typ på %s, förväntade %s.

source: Modification or redeclaration of protected elements is not allowed. Element: %s, modification: %s.
sv: Modifikation eller omdeklarering av skyddade element är ej tillåtet. \tElement: %s, modifikation: %s.

source: Tuple %s must contain component references only.
sv: Tupel %s får enbart innehålla komponent-referenser.

source: Missing redeclare keyword on redeclaration of class %s.
sv: Redeclare saknas på omdeklarering av klass %s.

source: %s found in several unqualified import statements (import ABC.*).
sv: %s hittades i flera okvalificerade import-satser (import ABC.*).

source: Found a component with same name when looking for type %s.
sv: Hittade en komponent med samma namn vid namnuppslagning av typen %s.

source: The base class name %s was found in one or more base classes:
sv: Basklass-namnet %s hittades i en eller flera basklasser:

source: Part %s of base class name %s is not a class.
sv: Delen %s av basklass-namnet %s är inte en klass.

source: %s is protected and cannot be accessed outside it's scope.
sv: %s är skyddad och kan inte nås utanför sin räckvidd.

source: Illegal modification %s (of %s).
sv: Otillåten modifikation %s (av %s).

source: Internal error %s
sv: Internt fel %s

source: Type mismatch in array expression in component %s. %s is of type %s while the elements %s are of type %s.
sv: Typfel i vektoruttryck i komponent %s. %s är av typ %s medan elementen %s är av typ %s.

source: Type mismatch in matrix rows in component %s. %s is a row of %s, the rest of the matrix is of type %s.
sv: Typfel i matrisrader i komponent %s. %s är en rad av typ %s medan resten av matrisen är av typ %s.

source: Incompatible row length in matrix expression in component %s. %s is a row of size %s, the rest of the matrix rows are of size %s.
sv: Inkompatibla radlängder i matrisuttryck i komponent %s. %s är en rad av storlek %s, resten av matrisens rader har storlek %s.

source: Operand of %s in component %s must be builtin-type in %s.
sv: Operand av %s i komponent %s måste vara av inbyggd typ i %s.

source: Wrong type or wrong number of arguments to %s (in component %s).
sv: Fel typ eller fel antal argument till %s (i komponent %s).

source: Different dimension sizes in arguments to %s in component %s.
sv: Olika antal dimensioner i argument till %s i komponent %s.

source: Import %s not found in scope %s.
sv: Import %s hittades inte definitionsområde %s.

source: Import %s is shadowed by a local element.
sv: Import %s skuggar ett lokalt element.

source: %s argument to %s in component %s must be Integer expression.
sv: %s argument till %s i komponent %s måste vara heltalsuttryck.

source: %s argument to %s in component %s must be discrete variable.
sv: %s argument till %s i komponent %s måste vara en diskret variabel.

source: Type in %s must be simple type in component %s.
sv: Typ i %s måste vara en enkel typ i komponent %s.

source: %s argument to %s in component %s must be a variable.
sv: %s argument till %s i komponent %s måste vara en variabel.

source: No matching function found for %s in component %s candidates are %s
sv: Ingen matchande funktion för %s i komponent %s kandidater är %s

source: No matching function found for %s.
sv: Ingen matchande funktion för %s.

source: Component %s in function is neither input nor output.
sv: Komponent %s i funktion är varken input eller output.

source: Slot %s already filled in a function call in component %s.
sv: Plats %s är redan fylld i funktionsanrop i komponent %s.

source: Function %s has no argument named %s.
sv: Funktionen %s har inget argument med namn %s.

source: %s is a constant or parameter with a non-constant initializer %s.
sv: %s är en konstant eller parameter med icke-konstant initierare %s.

source: Subscript %s of type %s is not a subtype of Integer, Boolean or enumeration.
sv: Subscript %s av type %s är inte en subtyp av Integer, Boolean eller enumeration.

source: Type mismatch in if-expression in component %s. True branch: %s has type %s, false branch: %s has type %s.
sv: Typfel i if-uttryck i komponent %s. Sann gren: %s har typ %s, falsk gren: %s har typ %s.

source: Cannot resolve type of expression %s. The operands have types %s in component %s.
sv: Kan inte lösa typ av uttryck %s i komponent %s.

source: Incompatible argument types to operation %s in component %s, left type: %s, right type: %s
sv: Inkompatibla argumenttyper till operation %s i komponent %s, vänster typ: %s, höger typ: %s

source: Class %s does not satisfy the requirements for a package. Lookup is therefore restricted to encapsulated elements, but %s is not encapsulated.
sv: Klassen %s uppfyller inte kraven för ett paket. Namnuppslagningen begränsas därför till element med encapsulated, men %s är inte encapsulated.

source: Class %s inherits builtin type but has components.
sv: Klass %s ärver inbyggd typ men har komponenter.

source: Type mismatch in modifier of component %s, expected type %s, got modifier %s of type %s.
sv: Typfel i modifikation av komponent %s, förväntade typ %s, fick modifikation %s av typ %s.

source: Error occurred while flattening model %s
sv: Fel inträffade under utflatning av modell %s

source: Duplicate elements (due to inherited elements) not identical: first element is: %s second element is: %s
sv: Duplicerade element (på grund av arv) är ej identiska: första elementet är: %s andra elementet är: %s

source: Variable %s in package %s is not constant.
sv: Variabel %s i paket %s är inte konstant.

source: Declaration of element %s causes recursive definition of class %s.
sv: Deklaration av element %s skapar en rekursiv definition av klass %s.

source: Expression %s in for-statement must be an array type.
sv: Uttryck %s i for-sats måste vara ett vektoruttryck.

source: Found non-class %s while looking for function via component. The only valid form is c.C1..CN.f where c is a scalar component and C1..CN are classes.
sv: Hittade icke-klass %s under sökning efter funktion via komponent. Den enda giltiga formen är c.C1..CN.f där c är en skalär komponent och C1..CN är klasser.

source: The same variables must me solved in elsewhen clause as in the when clause.
sv: Samma variabler måste lösas i elsewhen-satsen som i when-satsen.

source: Found class %s during lookup of composite component name, expected component.
sv: Hittade klass %s under namnuppslagning av sammansatt komponentnamn, komponent förväntades.

source: Type mismatch in modifier of component %s, declared type %s, got modifier %s of type %s.
sv: Typfel i modifikation av komponent %s, deklarerad typ %s, fick modifikation %s av typ %s.

source: Assertion triggered during translation: %s.
sv: Assertion utlöst under översättningen: %s.

source: Subscript '%s' for dimension %s (size = %s) of %s is out of bounds.
sv: Subscriptet %s för dimension %s (storlek = %s) är utanför vektorns gränser.

source: Component condition must be parameter or constant expression (in %s).
sv: Komponentvillkor måste vara ett parameter- eller konstant-uttryck (i %s).

source: Found class %s by name lookup via component (only component and function call names may be looked up via a component).
sv: Hittade klass %s vid namnuppslagning via komponent (endast komponent- och funktionsanrop-namn kan slås upp via en komponent).

source: Found function %s by name lookup via component, but this is only valid when the name is used as a function call.
sv: Hittade funktion %s vid namnuppslagning via komponent, men detta är endast tillåtet när namnet används som ett funktionsanrop.

source: Duplicate modification of element %s on %s.
sv: Upprepad modifiering av element %s på %s.

source: Illegal subscript %s for dimensions %s in component %s.
sv: Otillåtet subskript %s för dimensioner %s i komponent %s.

source: Illegal type in equation %s, only builtin types (Real, String, Integer, Boolean or enumeration) or record type allowed in equation.
sv: Ogiltig typ i ekvation %s, endast inbyggda typer (Real, String, Integer, Boolean eller enumeration) eller record typer tillåts i ekvationen.

source: Assertion failed in function, message: %s
sv: Assertion misslyckades i funktion, meddelande: %s

source: %s is partial, name lookup is not allowed in partial classes.
sv: %s är partiell, namnuppslagning är inte tillåtet i partiella klasser.

source: No corresponding 'inner' declaration found for component %s declared as '%s'. The existing 'inner' components are: %s Check if you have not misspelled the 'outer' component name. Please declare an 'inner' component with the same name in the top scope. Continuing flattening by only considering the 'outer' component declaration.
sv: Ingen motsvarande 'inner' deklaration hittades för komponent %s deklarerad som '%s'. De existerande 'inner' komponenterna är: %s Kontrollera att du inte har stavat fel i namnet på din 'outer' komponent. Var vänlig deklarera en 'inner' komponent med samma namn i det översta definitionsområdet. Fortsätter utflatning genom att enbart överväga 'outer' komponenten.

source: The iteration range %s is not a constant or parameter expression.
sv: Det första argumentet av %s måste vara ett vektoruttryck.

source: Identifier %s of implicit for iterator must be present as array subscript in the loop body.
sv: Identifierare %s av implicit for-iterator måste vara närvarande som vektorsubskript i loop-kroppen.

source: Lookup of element %s is not allowed via component %s when looking for %s (only function calls may be looked up via a component).
sv: Åtkomst av element %s är ej tillåtet via komponent %s vid uppslagning av %s (endast funktionsanrop får användas via komponenter).

source: Lookup of class %s is not allowed in composite component name %s (only components may be looked up in this way).
sv: Uppslagning av klass %s är ej tillåten i sammansatt komponentnamn %s (endast komponenter får användas på detta sätt).

source: Function call %s contains subscripts.
sv: Funktionsanropet %s innehåller subskript.

source: In equation %s. If-equation with conditions that are not parameter expressions must have the same number of equations in each branch, equation count is %s for each respective branch.
sv: I ekvation %s. If-ekvationer med villkor som inte är parameteruttryck måste ha samma antal ekvationer i varje gren, ekvationsantal är %s för respektive gren.

source: Missing else-clause in if-equation with non-parameter conditions.
sv: Else-sats saknas i if-ekvation med icke-parameter-villkor.

source: connect may not be used inside if-equations with non-parametric conditions (found connect(%s, %s)).
sv: connect får ej användas i if-ekvationer med icke-parametriska villkor (hittade connect(%s, %s)).

source: connect may not be used inside when-equations (found connect(%s, %s)).
sv: connect får ej användas i when-ekvationer (hittade connect(%s, %s)).

source: Incompatible components in connect statement: connect(%s, %s) - %s has components %s - %s has components %s
sv: Inkompatibla komponenter i connect-sats: connect(%s, %s) - %s har komponenter %s - %s har komponenter %s

source: Illegal connecting two outer connectors in statement connect(%s, %s).
sv: Otillåtet att ansluta två outer connectors i sats connect(%s, %s).

source: in statement %s, subscript %s is not a parameter or constant.
sv: I sats %s, subskript %s är varken parameter eller konstant.

source: Unmatched dimension in equation connect(%s, %s), %s != %s.
sv: Dimensioner i ekvation connect(%s, %s) stämmer ej överens, %s != %s.

source: Non-array modification '%s' for array component, possibly due to missing 'each'.
sv: Icke-vektormodifikation '%s' för vektorkomponent, möjligen på grund av att 'each' saknas.

source: In scope %s, in component %s: Invalid dimensions %s in %s, no more than one dimension may have size > 1.
sv: I definitionsområde %s, i komponent %s: Ogiltiga dimensioner %s i %s, högst en dimension får ha längd > 1.

source: Unable to unroll for loop containing when statements or equations: %s.
sv: Kan inte utföra loop unrolling i for-loop som innehåller when-satser eller when-ekvationer: %s.

source: Variable '%s' has a cyclic dependency and has variability %s.
sv: Variabel '%s' har ett cykliskt beroende och har variabilitet %s.

source: Nested when statements are not allowed.
sv: Nästlade when-satser är otillåtna.

source: Invalid use of reserved attribute name %s as enumeration literal.
sv: Ogiltigt användande av reserverat attributnamn %s som enumerationslitteral.

source: Function %s has not the expected inputs. Expected inputs are %s.
sv: Funktion %s har inte de förväntade inparametrarna. De förväntade inparametrarna är %s.

source: Duplicate class definitions (due to inheritance) not equivalent, first definition is: %s, second definition is: %s.
sv: Duplicerad klassdefinition (på grund av arv) inte ekvivalent, första definitionen är: %s, andra definitionen är: %s.

source: Component %s of variability %s has binding %s of higher variability %s.
sv: Komponent %s med variabilitet %s har bindning %s av högre variabilitet %s.

source: If-equations are only partially supported. Ignoring %s.
sv: If-ekvationer stöds enbart delvis. Ignorerar %s.

source: If-equation with conditions that are not parameter expressions must have the same number of equations in each branch, equation count is %s for each respective branch: %s
sv: If-ekvation med villkor som inte är parameteruttryck måste ha samma antal ekvationer i varje gren, ekvationsantal är %s för respektive gren: %s

source: Failed to instantiate equation %s.
sv: Misslyckades att instansiera ekvation %s.

source: Forcing full instantiation of partial class %s during checkModel.
sv: Tvingar full instansiering av partiell klass %s under checkModel.

source: Type mismatch in binding %s = %s, expected subtype of %s, got type %s.
sv: Typfel i bindning %s = %s, förväntade en deltyp av %s, fick typ %s.

source: Component %s has the same name as its type %s. This is forbidden by Modelica specification and may lead to lookup errors.
sv: Komponent %s har samma namn som dess typ %s. Detta är förbjudet enligt Modelica-specifikationen och kan leda till namnuppslagningsproblem.

source: Instantiation of array component: %s failed because index modification: %s is invalid. Array component: %s has more dimensions than binding %s.
sv: Instansiering av vektorkomponent: %s misslyckades på grund av ogiltig modifikation %s. Vektorkomponent: %s har fler dimensioner än bindning %s.

source: Duplicate modifications for attribute: %s in modifier: %s. Considering only the first modification: %s and ignoring the rest %s.
sv: Flera modifikationer för attribut: %s i modifikation: %s. Tar endast hänsyn till den första modifikationen: %s och ignorerar resten %s.

source: %s has a function pointer as input. OpenModelica does not support this feature in the interactive environment. Suggested workaround: Call this function with the arguments you want from another function (that does not have function pointer input). Then call that function from the interactive environment instead.
sv: %s har en funktionspekare som inargument. OpenModelica stödjer inte denna funktion i den interaktiva miljön. Föreslagen lösning: Anropa denna funktion med de argument du vill använda från en annan funktion (som inte tar en funktionspekare). Anropa sedan den funktionen från den interaktiva miljön istället.

source: Expected %s to be a %s, but found %s instead.
sv: Förväntade att %s skulle vara %s, men hittade %s istället.

source: Duplicate elements (due to inherited elements) not syntactically identical but semantically identical: first element is: %s second element is: %s Modelica specification requires that elements are exactly identical.
sv: Flera element (från arv) är inte syntaktiskt identiska men semantiskt identiska: första elementet är: %s andra elementet är: %s Modelica-specificationen kräver att elementen är exakt lika.

source: Failed to instantiate function %s in scope %s.
sv: Misslyckades instansiera funktion %s i definitionsområde %s.

source: Wrong number of arguments to %s.
sv: Fel antal argument till %s.

source: Tuple assignment only allowed for tuple of component references in lhs (in %s).
sv: Tilldelning av tupel tillåts endast för tupler av komponentreferenser i vänsterledet (i %s).

source: Looking for a function %s but found a %s.
sv: Letade efter en funktion %s men hittade en %s.

source: Operand %s to operator %s is not a stream variable.
sv: Operand %s till operator %s är inte en stream-variabel.

source: Connector %s is not balanced: %s
sv: Connector %s är inte balanserad: %s

source: Class specialization violation: %s is a %s, not a %s.
sv: Överträdelse av klass-specialisering: %s är en %s, inte en %s.

source: Step equals 0 in array constructor %s.
sv: Steglängd är 0 i vektorkonstruktör %s.

source: Recursive short class definition of %s in terms of %s.
sv: Rekursiv kort klassdefinition av %s i form av %s.

source: Wrong number of subscripts in %s (%s subscripts for %s dimensions).
sv: Fel antal subskript i %s (%s subskript för %s dimensioner).

source: Element is not allowed in function context: %s
sv: Elementet är inte tillåtet i funktions-sammanhang: %s

source: Duplicate classes on top level is not allowed (got %s).
sv: Duplicerade klasser på toppnivån är inte tillåtna (fick %s).

source: Invalid left-hand side of when-equation: %s.
sv: Ogiltigt vänsterled i when-ekvation: %s.

source: Failed to elaborate expression: %s.
sv: Misslyckades med att utarbeta uttryck: %s.

source: Ignoring external declaration of the extended class: %s.
sv: Ignorerar extern sektion i den ärvda klassen: %s.
