Repository: OpenModelica/OMCompiler
Catalog: Compiler/Translation/*.po
Languages: sv

source: An element with name %s is already declared in this scope.
sv: Ett element med namn %s är redan deklarerat i detta definitionsområde.

source: Invalid redeclaration of class %s, class extends only allowed on inherited classes.
sv: Ogiltig omdeklaration av klass %s, class extends är endast tillåtet på ärvda klasser.

source: Qualified import name %s already exists in this scope.
sv: Importerat namn %s finns redan i detta definitionsområde.

source: %s was found in base class %s.
sv: %s hittades ej i basklass %s.

source: Function %s not found in scope %s.
sv: Funktion %s hittades inte i definitionsområde %s.

source: Failed to elaborate %s as a code expression of type %s.
sv: Kunde inte utveckla %s som ett code-uttryck av typ %s.

source: Equations are not allowed in %s.
sv: Ekvationer tillåts inte i %s.

source: The called uniontype record (%s) contains a member (%s) that has a uniontype record as its type instead of a uniontype.
sv: Record (%s) innehåller en medlem (%s) som har en typ som refererar till ett record i en uniontype istället för en uniontype.

source: Invalid external object %s, %s.
sv: Ogiltigt externt objekt %s, %s.

source: Cyclically dependent constants or parameters found in scope %s: %s.
sv: Cykliskt beroende konstanter eller parametrar hittades i definitionsområde %s: %s.

source: Failed to deduce dimensions of %s due to unknown dimensions of modifier %s.
sv: Det gick inte att härleda dimensionerna i %s på grund av okända dimensioner i modifikationen %s.

source: Part %s of base class %s is replaceable.
sv: Delen %s av basklassen %s är replaceable.

source: Non-replaceable base class %s in class extends.
sv: Icke-replaceable basklass %s i class extends.

source: From here:
sv: Härifrån:

source: The lhs (result) of the external function declaration is not a component reference: %s.
sv: Vänsterledet (resultatet) av den externa funktionsdeklarationen är inte en komponentreferens: %s.

source: The lhs (result) of the external function declaration is not a variable.
sv: Vänsterledet (resultatet) av den externa funktionsdeklarationen är inte en variabel.

source: The lhs (result) of the external function declaration has array type (%s), but this is not allowed in the specification. You need to pass it as an input to the function (preferably also with a size()-expression to avoid out-of-bounds errors in the external call).
sv: Vänsterledet (resultatet) av den externa funktionsdeklarationen har en vektortyp (%s), men detta tillåts inte i specifikationen. Du måste skicka den som argument till funktionen (gärna även med ett size()-uttryck för att undvika indexering utanför vektorns gränser i den externa koden).

source: Redeclaration of %s %s %s is not allowed.
sv: Omdeklaration av %s %s %s är inte tillåtet.

source: Invalid type prefix '%s' on %s %s, due to existing type prefix '%s'.
sv: Ogiltig typprefix '%s' på %s %s, på grund av existerande typprefix '%s'.

source: Linear solver (%s) returned invalid input for linear system %s.
sv: Linjär lösare (%s) returnerade ogiltig indata för linjärt system %s.

source: Array constructor may not be empty.
sv: Vektorkonstruktor får inte vara tom.

source: Requested package %s of version %s, but this package was already loaded with version %s. You might experience problems if these versions are incompatible.
sv: Begärde paket %s med version %s, men detta paket var redan laddat med version %s. Du kan uppleva problem om dessa versioner är inkompatibla.

source: Failed to load package %s (%s) using MODELICAPATH %s.
sv: Misslyckades ladda paket %s (%s) med MODELICAPATH %s.

source: Base class %s is replaceable.
sv: Basklass %s är replaceable.

source: Invalid index %s in call to size of %s, valid index interval is [1,%s].
sv: Ogiltigt index %s i anrop till size av %s, giltigt intervall för index är [1,%s].

source: Algorithm section is not allowed in %s.
sv: Algoritmsektion tillåts inte i %s.

source: Failed to deduce dimensions of %s due to missing binding equation.
sv: Kunde inte härleda dimension av %s på grund av att en bindande ekvation saknas.

source: The behavior of multiple algorithm sections in function %s is not standard Modelica. OpenModelica will execute the sections in the order in which they were declared or inherited (same ordering as inherited input/output arguments, which also are not standardized).
sv: Beteendet av att ha flera algoritm-sektioner i funktion %s är inte standard Modelica. OpenModelica kommer att exekvera sektionerna i den ordning de deklarerades eller ärvdes (samma ordning som för ärvda in/ut argument, som inte heller är standardiserat).

source: Failed to instantiate statement: %s
sv: Misslyckades instansiera sats: %s

source: %s is an unbound output in external function %s. Either add it to the external declaration or add a default binding.
sv: %s är en obunden utvariabel i extern funktion %s. Lägg till den i den externa deklarationen eller lägg till en bindning.

source: Unused input variable %s in function %s.
sv: Oanvänd invariabel %s i funktion %s.

source: Array types mismatch: %s and %s.
sv: Vektortypfel: %s och %s.

source: Could not vectorize call with unknown dimensions due to finding two for-iterators: %s and %s.
sv: Kunde inte vektorisera anrop med okända dimensioner på grund av att två foreach argument hittades: %s och %s.

source: Function argument %s=%s is not a %sexpression.
sv: Funktionsargument %s=%s är inte ett %s uttryck.

source: Invalid dimension %s of argument to %s, expected dimension size %s but got %s.
sv: Ogiltig dimension %s av argument till %s, förväntad dimensionsstorlek %s men fick %s.

source: %s is already redeclared in this scope.
sv: %s är redan omdeklarerad i detta definitionsområde.

source: Invalid type %s for function component %s.
sv: Ogiltig typ %s för funktionskomponent %s.

source: An independent subset of the model has imbalanced number of equations (%s) and variables (%s). variables: %s equations: %s
sv: En oberoende delmängd av modellen har ett obalanserat antal ekvationer (%s) och variabler (%s). variabler: %s ekvationer: %s

source: Variable %s is not referenced in any equation (possibly after symbolic manipulations).
sv: Variabel %s refereras inte till i någon ekvation (kanske på grund av symboliska manipulationer).

source: Invalid public variable %s, function variables that are not input/output must be protected.
sv: Ogiltig variabel %s, funktionsvariabler som inte är in/ut måste vara skyddade (protected).

source: Invalid protected variable %s, function variables that are input/output must be public.
sv: Ogiltig skyddad variabel %s, funktionsvariabler som är in/ut måste vara i en public-sektion.

source: Function argument %s was not given by the function call, and does not have a default value.
sv: Funktionsargument %s gavs inte av funktionsanropet och saknar standardvärde.

source: connect(%s, %s) connects the same connector instance! The connect equation will be ignored.
sv: connect(%s, %s) ansluter till samma instans! Connect-ekvationen ignoreras.

source: Stack overflow occurred while evaluating %s.
sv: Stackspill inträffade då %s evaluerades.

source: Unknown debug flag %s.
sv: Okänd debug-flagga %s.

source: Invalid type of flag %s, expected %s but got %s.
sv: Ogiltig typ av flagga %s, förväntade %s men fick %s.

source: Modelica language version set to %s due to loading of MSL %s.
sv: Modelica språkversion satt till %s på grund av laddning av MSL %s.

source: Expression simplification iterated to the fix-point maximum, which may be a performance bottleneck. The last two iterations were: %s, and %s.
sv: Förenkling av uttryck konvergerade inte till fixpunkt, vilket kan vara en flaskhals. De två sista iterationerna var: %s och %s.

source: Unknown option %s.
sv: Okänt alternativ %s.

source: Subscripted modifier is illegal.
sv: Modifikation med subskript är inte tillåtet.

source: Class specialization violation: %s is a %s, which may not contain an %s.
sv: Överträdelse av klass-specialisering: %s är en %s, som inte får innehålla en %s.

source: Failed to insert class %s %s the available classes were:%s
sv: Misslyckades infoga klass %s %s de tillgängliga klasserna var:%s

source: Modified element %s not found in class %s.
sv: Modifierat element %s hittades inte i klass %s.

source: Invalid redeclaration, attributes of basic types can not be redeclared.
sv: Ogiltig omdeklaration, attribut för grundtyper kan inte omdeklareras.

source: Invalid stream connector %s: %s
sv: Ogiltig stream connector %s: %s

source: Type mismatch in condition '%s' of component %s. Expected a Boolean expression, but got an expression of type %s.
sv: Fel typ i villkor '%s' hos komponent %s. Förväntade Boolean, men fick ett uttryck av typ %s.

source: The compiler failed to perform constant folding on expression %s. Please report this bug to the developers and we will fix it as soon as possible (using the +t compiler option if possible).
sv: Kompilatorn misslyckades att utföra 'constant folding' på uttryck %s. Var vänlig rapportera detta fel till utvecklarna så kommer vi lösa det så snart som möjligt (använd flaggan +t till kompilatorn om det är möjligt).

source: In sum(%s), the expression is of type %s, but is required to be of builtin array type (of any number of dimensions).
sv: I sum(%s), uttrycket har typ %s, men måste vara av inbyggd vektortyp (av godtyckligt antal dimensioner).

source: Invalid specialized class type '%s' for component %s.
sv: Ogiltig specialiserad klasstyp '%s' för komponent %s.

source: Connect equations are not allowed in initial equation sections.
sv: Connect-ekvationer är inte tillåtna i en initial equation sektion.

source: Trying to override final component %s with modifier %s.
sv: Försöker överskrida slutgiltig komponent %s med modifikation %s.

source: Automatically loaded package %s %s due to uses annotation.
sv: Laddade paket %s %s med automatik tack vare en uses-annotation.

source: The first argument to reinit must be a subtype of Real, but %s has type %s.
sv: Det första argumentet till reinit måste vara en undertyp till Real, men %s har typ %s.

source: The first argument to reinit must be a variable, but %s is a %s.
sv: Det första argumentet till reinit måste vara en variabel, men %s är en %s.

source: Connecting two signal sources while connecting %s to %s.
sv: Ansluter två signalkällor då %s ansluts till %s.

source: Invalid prefix %son formal parameter %s.
sv: Ogiltigt prefix %s på formell parameter %s.

source: Illegal redeclare of element %s, no inherited element with that name exists.
sv: Otillåten omdeklarering av element %s, inget ärvt element med det namnet finns.

source: The first argument of %s must be an array expression.
sv: Det första argumentet av %s måste vara ett vektoruttryck.

source: The first argument of %s must be on the form A.R, where A is a connector and R an over-determined type/record.
sv: Det första argumentet till %s måste vara på formen A.R, där A är en connector och R en överbestämd type/record.

source: The second argument of %s must be on the form A.R, where A is a connector and R an over-determined type/record.
sv: Det andra argumentet till %s måste vara på formen A.R, där A är en connector och R en överbestämd type/record.

source: The first argument of %s must be an over-determined type or record.
sv: Det första argumentet till %s måste vara en överbestämd type/record.

source: The second argument of %s must be an over-determined type or record.
sv: Det andra argumentet till %s måste vara en överbestämd type/record.

source: Modelica library files should contain exactly one package, but found the following classes: %s.
sv: Modelicabiblioteksfiler ska innehålla exakt ett paket, men fann följande klasser: %s.

source: Expected the package to have %s but got %s.
sv: Förväntade paketet att ha %s men fick %s.

source: Expected the package to have name %s, but got %s.
sv: Förväntade att paketet skulle ha namnet %s, men fick %s.

source: Elements in the package.mo-file need to be in the same relative order as the package.order file. Got element named %s but it was already added because it was not the next element in the list at that time.
sv: Element i package.mo-filen måste vara i samma relativa ordning som package.order-filen. Fick ett element med namn %s, men detta element finns tidigare i package.order.

source: %s is a package.mo-file and needs to be based on class parts (i.e. not class extends, derived class, or enumeration).
sv: %s är en package.mo-fil och måste vara en lång klassdefinitions (d.v.s. inte class extends, enumeration, eller kort arv).

source: %1 was referenced in the package.order file, but was not found in package.mo, %1/package.mo or %1.mo.
sv: %1 refererades till i package.order-filen, men hittades inte i package.mo, %1/package.mo eller %1.mo.

source: Got element %1 that was not referenced in the package.order file.
sv: Fick element %1 som inte refererades till i package.order-filen.

source: Components referenced in the package.order file must be moved in full chunks. Either split the constants to different lines or make them subsequent in the package.order file.
sv: Komponenter som refereras till i package.order-filen måste flyttas i hela block. Dela antingen upp konstanterna till olika rader eller gör så att de kommer i rätt ordning i package.order-filen.

source: Guard expressions need to be Boolean, got expression of type %s.
sv: Vaktuttryck måste vara Boolean, fick uttryck av typ %s.

source: User-defined function calls that return Array<...> are not supported: %s.
sv: Användardefinierade functionsanrop som returnerar Array<...> stöds ej: %s.

source: Failed elaborate assignment for some unknown reason: %1 := %2. File a bug report and we will make sure this error gets a better message in the future.
sv: Elaborering av tillsdelningsuttryck misslyckades av okänd orsak: %1 := %2.

source: %s was used before it was defined (given a value). Additional such uses may exist for the variable, but some messages were suppressed.
sv: %s användes innan den definierades (gavs ett värde). Fler sådana fall kan existera för variabeln, men vissa meddelanden undertrycktes.

source: Expression %1 has type %3, expected type %2.
sv: Uttryck %1 har typ %3, förväntad typ %2.

source: Found duplicate names in package.order file: %s.
sv: Hittade duplicerade namn i package.order-fil: %s.

source: Got type mismatch error, but matching types %s. This is a ***COMPILER BUG***, please report it to https://trac.openmodelica.org/OpenModelica.
sv: Fick typfel men matchande typer %s. Detta är en ***KOMPILATORBUG***, var god raportera den till https://trac.openmodelica.org/OpenModelica.

source: The first argument to reinit must be a variable of type Real or an array of such variables.
sv: Det första argumentet till reinit måste vara en variabel av typ Real eller en array av sådana variabler.

source: Cannot assign slice to non-initialized array %s.
sv: Kan inte tilldela slice till icke-initialiserad array %s.

source: Expression %s cannot be an external argument. Only identifiers, scalar constants, and size-expressions are allowed.
sv: Uttrycket %s kan inte vara ett externt argument. Endast identifierare, skalärkonstanter, och size-uttryck är tillåtna.

source: Only classes of type 'operator record' may contain elements of type 'operator function'; %s was found in a class that has restriction '%s'.
sv: Endast klasser av typen 'operator record' får innehålla element av typen 'operator function'; %s hittades i en klass med restriktionen '%s'.

source: 'operator record' classes may only contain elements of type 'operator function'; %s has restriction '%s'.
sv: Klasser med restriktionen 'operator record' får endast innehålla element av typen 'operator funktion'; %s har restriktionen '%s'.

source: Initialization problem is structurally singular, error found sorting equations %s for variables %s
sv: Initialiseringsproblemet är strukturellt singulär; fel hittades under sortering av ekvationerna %s för variablerna %s

source: The parameter %s has fixed = false and a binding equation %s = %s, which is probably redundant. Setting fixed = false usually means there is an additional initial equation to determine the parameter value. The binding was ignored by old Modelica tools, but this is not according to the Modelica specification. Please remove the parameter binding, or bind the parameter to another parameter with fixed = false and no binding.
sv: Parametern %s har fixed = false och en bunden ekvation %s = %s, vilket förmodligen är redundant. fixed = false betyder oftast att det finns extra initial-ekvation för att bestämma parameterns värde. Den bundna ekvationen ignorerades av äldre Modelica-verktyg, men detta är ej korrekt enligt Modelica-specifikationen. Den bundna ekvationen bör antingen tas bort helt, eller ändras till en annan parameter med fixed = false och ingen bunden ekvation.

source: The parameter %s has fixed = false and a binding equation %s = %s, which is probably redundant. The binding equation will be ignored, as it is expected for Modelica 3.1.
sv: Parametern %s har fixed = false och en bunden ekvation %s = %s, vilket förmodligen är redundant. Den bundna ekvationen kommer att ignoreras då Modelica 3.1 används.

source: The parameter %s has fixed = false, a start value, start = %s and a binding equation %s = %s, which is probably redundant. The binding equation will be ignored, as it is expected for Modelica 3.1.
sv: Parametern %s har fixed = false, ett start-värde start = %s, och en bunden ekvation %s = %s, vilket förmodligen är redundant. Den bundna ekvationen kommer att ignoreras då Modelica 3.1 används.

source: Model statistics after passing the front-end and creating the data structures used by the back-end: * Number of equations: %s * Number of variables: %s
sv: Modellstatistik efter frontend och skapande av datastrukturer som används av backend: * Antal ekvationer: %s * Antal variabler: %s

source: Model statistics after passing the back-end for %s: * Number of independent subsystems: %s * Number of states: %s * Number of discrete variables: %s * Number of discrete states: %s * Top-level inputs: %s
sv: Modellstatistik efter backend för %s: * Antal oberoende subsystem: %s * Antal tillståndsvariabler: %s * Antal diskreta variabler: %s * Antal diskreta tillståndsvariabler: %s * Antal input-variabler på toppnivå: %s

source: Mixed equation statistics: * Mixed systems with single equation: %s * Mixed systems with array equation: %s * Mixed systems with algorithm: %s * Mixed systems with complex equation: %s * Mixed systems with constant Jacobian: %s * Mixed systems with linear Jacobian: %s * Mixed systems with non-linear Jacobian: %s * Mixed systems with analytic Jacobian: %s * Mixed systems with linear tearing system: %s * Mixed systems with nonlinear tearing system: %s
sv: Statistik för mixade ekvationer: * Mixade system med en ensam ekvation :%s * Mixade system med vektorekvation: %s * Mixade system med algoritm: %s * Mixade system med komplex ekvation: %s * Mixade system med konstant Jacobian: %s * Mixade system med linjär Jacobian: %s * Mixade system med ickelinjär Jacobian: %s * Mixade system med analytisk Jacobian: %s * Mixade system med linjärt tearingsystem: %s * Mixade system med ickelinjärt tearingsystem: %s

source: Strong component statistics for %s (%s): * Single equations (assignments): %s * Array equations: %s * Algorithm blocks: %s * Record equations: %s * When equations: %s * If-equations: %s * Equation systems (linear and non-linear blocks): %s * Torn equation systems: %s * Mixed (continuous/discrete) equation systems: %s
sv: Statistik för starkt sammankopplade komponenter för %s (%s): * Ensamstående ekvationer (tilldelningar): %s * Vektorekvationer: %s * Algoritmblock: %s * Record-ekvationer: %s * When-ekvationer: %s * If-ekvationer: %s * Ekvationssystem (linjära och ickelinjära block): %s * Splittrade ekvationssystem: %s * Mixade (kontinuerliga/diskreta) ekvationssystem: %s

source: Equation system details: * Constant Jacobian: %s * Linear Jacobian (size,density): %s * Non-linear Jacobian: %s * Without analytic Jacobian: %s
sv: Detaljer för ekvationssystem: * Konstant Jacobian: %s * Linjär Jacobian (storlek, densitet): %s * Ickelinjär Jacobian: %s * Utan analytisk Jacobian: %s

source: Torn system details: * Linear torn systems: %s * Non-linear torn systems: %s
sv: Detaljer för splittrade system: * Linjära splittrade system: %s * Ickelinjära splittrade system: %s

source: The following Modelica-like model represents the back-end DAE for the '%s' stage: %s
sv: Följande Modelica-liknande modell representerar backend-DAEn för fasen '%s': %s

source: Negative dimension index (%s) for component %s.
sv: Negativ storlek på dimension (%s) för komponenten %s.

source: Failed to get dependencies for package %s. Perhaps there is an import to a non-existing package.
sv: Misslyckades att hämta beroenden för paket %s. Det kanske finns en import till ett icke-existerande paket.

source: The default value of %s causes a cyclic dependency.
sv: Standardvärdet av %s orsakar ett cykliskt beroende.

source: Type mismatch for named argument in %s(%s=%s). The argument has type: %s expected type: %s
sv: Typfel för det namngivna argumentet i %s (%s = %s). Argumentet har typen: %s förväntat typ: %s

source: Type mismatch for positional argument %s in %s(%s=%s). The argument has type: %s expected type: %s
sv: Typfel för det positionella argumentet %s i %s (%s = %s). Argumentet har typen: %s förväntat typ: %s

source: Operator overloading requires exactly one matching expression, but found %s expressions: %s
sv: Operatoröverlagring kräver exakt ett matchande uttryck, men %s uttryck hittades: %s

source: Operator %s is not an input to the overloaded function: %s
sv: Operatorn %s är inte indata till den överlagrade funktionen: %s

source: The following structural parameters were evaluated in the front-end: %s Structural parameters are parameters used to calculate array dimensions or branch selection in certain if-equations or if-expressions among other things.
sv: De följande strukturella parametrarna evaluerades i frontenden: %s Strukturella parametrar är parametrar som bl.a. används för att beräkna vektordimensioner eller välja grenar i vissa if-ekvationer eller if-uttryck.

source: Expression simplification '%s' → '%s' changed the type from %s to %s.
sv: Uttrycksförenklingen '%s' → '%s' ändrade typen från %s till %s.

source: Failed to vectorize function call because arguments %s=%s and %s=%s have mismatched dimensions %s and %s.
sv: Misslyckades att vektorisera funktionanrop eftersom argumenten %s = %s och %s = %s har olika dimensioner %s och %s.

source: Non-tuple complex type specifiers need to have exactly one type name: %s.
sv: Specificerare för komplexa typer som ej är tupler måste ha exakt ett typenamn: %s.

source: Tuple complex type specifiers need to have more than one type name: %s.
sv: Specificerare för komplexa tupletyper måste ha mer än ett typnamn: %s.

source: Parameter %s has no value, and is fixed during initialization (fixed=true), using available start value (start=%s) as default value.
sv: Parameter %s saknar värde, men är fast under initiering (fixed=true). Använder tillgängligt start-värde (start=%s) som standardvärde.

source: Parameter %s has neither value nor start value, and is fixed during initialization (fixed=true).
sv: Parameter %s har varken värde eller startvärde, och är fast under initiering (fixed=true).

source: Function "product" has scalar as argument in %s in component %s.
sv: Funktionen "product" har en skalär som argument i %s i komponent %s.

source: Using over-determined solver for initialization. Setting fixed=false to the following variables: %s.
sv: Använder överbestämd lösare för initiering. Sätter fixed=false för följande variabler: %s.
