Repository: OpenModelica/OMCompiler
Catalog: Compiler/Translation/*.po
Languages: sv

source: Disables output of record constructors in the flat code.
sv: Stänger av utmatning av record-konstruktorer i utflatat kod.

source: Dumps the back-end DAE to a Modelica-like model after all symbolic transformations are applied.
sv: Dumpar backend-DAEn till en Modelica-liknande syntax efter att alla symboliska transformationer är utförda.

source: Evaluates functions complete and partially and checks for constant output.
sv: Evaluerar funktioner fullständigt och partiellt och letar upp konstanta outputs.

source: activates implicit codegen
sv: Aktiverar implicit kodgenerering

source: dumps debug information about the function evaluation
sv: Skriver ut debuginformation från funktionsevalueringen

source: Prints the structural parameters identified by the front-end
sv: Skriver ut strukturella parametrar identifierade av frontend

source: Shows a list of all iteration variables.
sv: Visar en lista på alla iterationsvariabler.

source: Accepts passing records with more fields than expected to a function. This is not allowed, but is used in Fluid.Dissipation. See https://trac.modelica.org/Modelica/ticket/1245 for details.
sv: Tillåter att recordinstanser med fler fält än förväntat används som funktionsargument. Detta är ej tillåtet, men används i Fluid.Dissipation. See https://trac.modelica.org/Modelica/ticket/1245 för detaljer.

source: Optimize the memory structure regarding the selected scheduler
sv: Optimiserar minnesstrukturen med avseende på den valda schemaläggaren

source: Dumps information of the clock partitioning.
sv: Skriver ut information om klock-partitioneringen.

source: Strips the environment prefix from path/crefs. Defaults to true.
sv: Strippar omgivningsprefix från paths/crefs. På som standard.

source: Does scode dependency analysis prior to instantiation. Defaults to true.
sv: Utför beroendeanalys på SCode för instantering. På som standard.

source: Prints information about instantiation cache hits and additions. Defaults to false.
sv: Skriver ut information om träffar och tillägg i instantieringscachen. Av som standard.

source: Dumps all the calculated units.
sv: Dumpar alla beräknade enheter.

source: Dumps all equations handled by the unit checker.
sv: Dumpar alla ekvationer som hanterats av enhetskontrollen.

source: Dumps all the equations handled by the unit checker as tree-structure.
sv: Dumpar alla ekvationer som hanterats av enhetskontrollen som trädstruktur.

source: Show the dae variable declarations as they happen.
sv: Visar variabeldeklarationer i DAEn när de inträffar.

source: Reshuffles the systems of equations.
sv: Blandar om ekvationssystemen.

source: Show information about expandable connector handling.
sv: Visa information om hur expanderbara anslutningar hanteras.

source: Used when running the testsuite.
sv: Används då testsviten körs.

source: Print the version and exit.
sv: Skriver ut versionen och avslutar.

source: Sets the target compiler to use.
sv: Anger den kompilator som ska användas.

source: Sets the grammar and semantics to accept.
sv: Anger den grammatik och semantik som ska godtas.

source: Sets the annotation version that should be used.
sv: Anger den annotations-version som ska användas.

source: Sets the language standard that should be used.
sv: Anger den språkstandard som ska användas.

source: Show error messages immediately when they happen.
sv: Visa felmeddelanden direkt då de inträffar.

source: Show annotations in the flattened code.
sv: Visa annotationer i utflatat kod.

source: Do not simplify expressions if set.
sv: Gör inte de dyraste förenklingarna av uttryck om satt.

source: Performs alias elimination and removes constant variables from the DAE, replacing all occurrences of the old variable reference with the new value (constants) or variable reference (alias elimination).
sv: Utför alias-eliminering och tar bort konstanta variabler från DAE:en, ersätter alla förekomster av gamla variabelreferenser med de nya värdena (konstanter) eller variabelreferenser (alias-eliminering).

source: This module expands all array equations to scalar equations.
sv: Denna modul expanderar alla vektorekvationer till skalärekvationer.

source: Structural parameters and parameters declared as final are evalutated and replaced with their value in other vars. They may no longer be changed in the init file.
sv: Strukturella parametrar och parametrar deklarerade som final beräknas och ersätts med deras värde i andra variabler. De kan inte längre ändras i init-filen.

source: Structural parameters and parameters declared as final are removed and replaced with their value. They may no longer be changed in the init file.
sv: Strukturella parametrar och parametrar deklarerade som final tas bort och ersätts av deras värde. De kan inte längre ändras i init-filen.

source: Structural parameters and parameters declared as final or protected are removed and replaced with their value. They may no longer be changed in the init file.
sv: Strukturella parametrar och parametrar deklarerade som final eller protected tas bort och ersätts av deras värde. De kan inte längre ändras i init-filen.

source: Replace all parameters with protected=true in the system.
sv: Byter ut alla parametrar med protected=true i ekvationssystemet.

source: Strips all parameter not present in the equations from the system.
sv: Tar bort alla parametrar som inte används i ekvationer i systemet.

source: Strips all variables not present in the equations from the system.
sv: Tar bort alla variabler som inte finns i systemets ekvationer.

source: Does the clock partitioning.
sv: Utför klock-partitionering.

source: Tries to simplify if equations by use of information from evaluated parameters.
sv: Försöker förenkla if-ekvationer genom att använda information från evaluerade parametrar.

source: Replace edge(b) = b and not pre(b) and change(b) = v <> pre(v).
sv: Ersätter edge(b) = b, not pre(b), och change(b) = v <> pre(v).

source: Transforms simple equations x=y to zero-sum equations 0=y-x.
sv: Omvandlar enkla ekvationer x=y till en residualekvation 0=y-x.

source: Expands all algorithms with initial statements for outputs.
sv: Expanderar alla algoritmer med initial-satser som utdata.

source: resolves linear equations in loops
sv: Löser linjära ekvationer i loopar

source: evaluates functions partially
sv: Evaluerar funktioner partiellt

source: No cheap matching.
sv: Ingen billig matchning.

source: Cheap matching, traverses all equations and match the first free variable.
sv: Billig matchning, går genom alla ekvationer och matchar den första lediga variabeln.

source: Random Karp-Sipser: R. M. Karp and M. Sipser. Maximum matching in sparse random graphs.
sv: Slumpmässig Karp-Sipser: R. M. Karp och M. Sipser. Maximal matchning i glesa slumpmässiga grafer.

source: Sets the cheap matching algorithm to use. A cheap matching algorithm gives a jump start matching by heuristics.
sv: Välj den billiga matchningsalgoritm som ska användas. En billig matchningsalgoritm ger en snabbstart till matchningen genom heuristik.

source: Breadth First Search based algorithm.
sv: Bredd-först sök-baserad algoritm.

source: Depth First Search based algorithm.
sv: Djup först sök-baserad algoritm.

source: Depth First Search based algorithm with look ahead feature.
sv: Djup först sök-baserad algoritm med look-ahead.

source: Depth First Search based algorithm with look ahead feature and fair row traversal.
sv: Djup först sök-baserad algoritm med look-ahead och rättvis traversering av rader.

source: Combined BFS and DFS algorithm.
sv: Kombinerad BFS och DFS algoritm.

source: Matching algorithm using push relabel mechanism.
sv: Matchningsalgoritm som använder push-relabel.

source: Depth First Search based Algorithm external c implementation.
sv: Djup först sök-baserad algoritm (extern C-implementering).

source: Breadth First Search based Algorithm external c implementation.
sv: Bredd först sök-baserad algoritm (extern C-implementering).

source: Depth First Search based Algorithm with look ahead feature external c implementation.
sv: Djup först sök-baserad algoritm med look-ahead (extern C-implementering).

source: Depth First Search based Algorithm with look ahead feature and fair row traversal external c implementation.
sv: Djup först sök-baserad algoritm med look-ahead och rättvis traversering av rader (extern C-implementering).

source: Combined BFS and DFS algorithm external c implementation.
sv: Kombinerad BFS och DFS algorithm (extern C-implementering).

source: Matching algorithm using push relabel mechanism external c implementation.
sv: Matchningsalgoritm med push-relabel (extern C-implementering).

source: Use the underlying ODE without the constraints.
sv: Används den underliggande ODEn utan restriktioner.

source: Simple index reduction method, select (dynamic) dummy states based on analysis of the system.
sv: Enkel indexreduktion, välj (dynamiska) dummy tillstånd baserat på analys av systemet.

source: Perform function inlining for function with annotation LateInline=true.
sv: Utför optimeringen "function inlining" för funktioner med annotering LateInline=true.

source: Evaluates constant linear systems (a*x+b*y=c; d*x+e*y=f; a,b,c,d,e,f are constants) at compile-time.
sv: Evaluerar konstanta linjära system (a*x+b*y=c; d*x+e*y=f; a,b,c,d,e,f är konstanter) under kompileringen.

source: Removed all unused functions from functionTree.
sv: Tar bort alla oanvända funktioner från funktionsträdet.

source: Simplifies time independent built in function calls like pre(param) -> param, der(param) -> 0.0, change(param) -> false, edge(param) -> false.
sv: Förenklar tidsoberoende anrop till inbyggda funktioner som pre(param) -> param, der(param) -> 0.0, change(param) -> false, edge(param) -> false.

source: Checks if derivatives of inputs are need to calculate the model.
sv: Kontrollerar om derivatan av inputvariabler behövs för att beräkna modellen.

source: Simplifies calls to semiLinear.
sv: Förenklar anrop till semiLinear.

source: Remove all constants in the system.
sv: Tar bort alla konstanter i systemet.

source: Detects the sparse pattern for Jacobian A.
sv: Detekterar det glesa mönstret för Jacobian A.

source: Reshuffles algebraic loops.
sv: Blandar om algebraiska loopar.

source: Sets the target language for the code generation.
sv: Anger målspråket för kodgenerering.

source: Orders connect equations alphabetically if set.
sv: Anger om kopplingsekvationer ska sorteras i bokstavsordning.

source: Prints out extra type information if set.
sv: Skriver ut extra typ-information.

source: Sets whether to split arrays or not.
sv: Anger om arrayer ska delas upp eller inte.

source: Enables valid modelica output for flat modelica.
sv: Slår på giltig Modelica-utskrift för den utplattade koden.

source: Turns on silent mode.
sv: Slår på tyst läge.

source: Sets the number of processors to use (0=default=auto).
sv: Anger antalet processorer som ska användas (0=default=auto).

source: Sets the latency for parallel execution.
sv: Anger latens för parallell exekvering.

source: Sets the bandwidth for parallel execution.
sv: Anger bandbredd för parallell exekvering.

source: Instantiate the class given by the fully qualified path.
sv: Instanseriar klassen som angivits med fullständig sökväg.

source: Sets the vectorization limit, arrays and matrices larger than this will not be vectorized.
sv: Ställer in gränsen för vektorisering; arrayer och matriser större än denna kommer inte vektoriseras.

source: Turns on simulation code generation.
sv: Slår på generering av simuleringskod.

source: Sets whether to evaluate parameters in annotations or not.
sv: Anger om parametrar i annoteringar ska evalueras eller inte.

source: Set when checkModel is used to turn on specific features for checking.
sv: Är satt då checkModel används för att slå på specifika funktioner för testning av modeller.

source: Turns on labeled SimCode generation for reduction algorithms.
sv: Sätter på märkning av SimCode-generering för reduktionsalgoritmer.

source: Turns on reducing terms for reduction algorithms.
sv: Slår på reducerande termer för reduktionsalgoritmer.

source: Sets the reduction method to be used.
sv: Anger den reduktionsmetod som ska användas.

source: Override the locale from the environment.
sv: Överskrid de nationella inställningarna i omgivningen.

source: Sets the default OpenCL device to be used for parallel execution.
sv: Anger vilken OpenCL-enhet som ska användas för parallell exekvering.

source: Maximal traversals to find simple equations in the acausal system.
sv: Slår på maximala traverseringar för att hitta enkla ekvationer i det akausala systemet.

source: Redirect the dump to file. If the file ends with .html HTML code is generated.
sv: Dirigerar utskrifter till fil. Om filen har ändelsen .html så genereras HTML-kod.

source: Enables (very) experimental code to break algebraic loops using the delay() operator. Probably messes with initialization.
sv: Slår på (väldigt) experimentell kod för att bryta algebraiska loopar med delay() operatorn. Förstör förmodligen initieringen.

source: Skip tearing.
sv: Hoppar över tearing.

source: Tearing method developed by TU Dresden: Frenkel, Schubert.
sv: Tearing-metod utvecklad av TU Dresden: Frenkel, Schubert.

source: Tearing based on Celliers method, revised by FH Bielefeld: Täuber, Patrick
sv: Tearing baserad på Celliers metod, reviderad av FH Bielefeld: Täuber, Patrick

source: Sets the tearing method to use. Select no tearing or choose tearing method.
sv: Anger tearing-metoden som ska användas i bakändan.

source: Original cellier with consideration of impossible assignments and discrete Vars.
sv: Original Cellier med hänsyn till omöjliga tilldelningar och diskreta variabler.

source: Modified cellier, drop first step.
sv: Modifierad Cellier, hoppa över första steget.

source: Modified MC1, new last step 'count impossible assignments'.
sv: Modifierad MC1, nytt sista steg 'räkna omöjliga tilldelningar'.

source: Modified MC1, step 'count impossible assignments' before last step.
sv: Modifierad MC1, steg 'räkna omöjliga tilldelningar' före sista steget.

source: Modified MC2, step 'count impossible assignments' before last step.
sv: Modifierad MC2, steg 'räkna omöjliga tilldelningar' före sista steget.

source: Modified MC1, build sum of impossible assignment and causalizable equations, choose var with biggest sum.
sv: Modifierad MC1, skapa summa av omöjliga tilldelningar och ordningsbara ekvationer, välj variabel med största summa.

source: Modified MC2, build sum of impossible assignment and causalizable equations, choose var with biggest sum.
sv: Modifierad MC2, skapa summa av omöjliga tilldelningar och ordningsbara ekvationer, välj variabel med största summa.

source: Modified MC23, Two rounds, choose better potentials-set.
sv: Modifierad MC23, två omgångar, välj bättre potential-set.

source: Modified cellier, build sum of impossible assignment and causalizable equations for all vars, choose var with biggest sum.
sv: Modifierad Cellier, skapa summa av omöjliga tilldelningar och ordningsbara ekvationer, välj variabel med största summa.

source: Modified cellier, use all heuristics, choose var that occurs most in potential sets
sv: Modifierad Cellier, använd alla heuristiker, välj variabel som förekommer mest i potential-set

source: Sets the tearing heuristic to use for Cellier-tearing.
sv: Anger tearing-heuristiken att använda för Cellier-tearing.

source: Scalarizes the builtin min/max reduction operators if true.
sv: Skaläriserar de inbyggda min/max reduceringsoperatorerna om sann.

source: Used when running the WSM testsuite.
sv: Används då WSM-testsviten körs.

source: Always scalarizes bindings if set.
sv: Skaläriserar alltid bindningar om sann.

source: Activates user given rewrite rules for Absyn expressions. The rules are read from the given file and are of the form rewrite(fromExp, toExp);
sv: Aktiverar användargivna omskrivningsregler för Absyn-uttryck. Reglerna läses från den givna filen och är på formen rewrite(frånUttryck, tillUttryck);

source: Default, do not replace homotopy.
sv: Standard, ersätt inte homotopy.

source: Replace homotopy(actual, simplified) with actual.
sv: Ersätt homotopy(actual, simplified) med actual.

source: Replace homotopy(actual, simplified) with simplified.
sv: Ersätt homotopy(actual, simplified) med simplified.

source: Replaces homotopy(actual, simplified) with the actual expression or the simplified expression. Good for debugging models which use homotopy. The default is to not replace homotopy.
sv: Ersätter homotopy(actual, simplified) med actual eller simplified. Används för att debugga modeller som använder homotopy. Standard är att inte ersätta homotopy.

source: Allow Integer to enumeration conversion.
sv: Tillåt konvertering av Integer till enumeration.

source: Generate code without profiling
sv: Genererar kod utan profilering

source: Generate code for profiling function calls as well as linear and non-linear systems of equations
sv: Generera kod för profilering av funktionsanrop samt för linjära och icke-linjära ekvationssystem

source: Like blocks, but also run xsltproc and gnuplot to generate an html report
sv: Som blocks, men kör även xsltproc och gnuplot för att generera en html-rapport

source: Generate code for profiling of all functions and equations
sv: Generera kod för profilering av alla funktioner och ekvationer

source: Generate code for profiling of all functions and equations with additional performance data using the papi-interface (cpp-runtime)
sv: Generera kod för profilering av alla funktioner och ekvationer med utökad prestanda-data m.h.a. papi-interfacet (cpp-runtime)

source: Sets the profiling level to use. Profiled equations and functions record execution time and count for each time step taken by the integrator.
sv: Ställ in profileringsnivå att använda. Profilerade ekvationer och funktioner sparar körtid och antal anrop för varje steg som integratorn tar.

source: sets tolerance of reshuffling algorithm: 1: conservative, 2: more tolerant, 3 resolve all
sv: Ställer in toleransen av blandnings-algoritmen: 1: konservativ, 2: mer tolerant, 3: lös alla

source: The command-line options available for omc.
sv: Kommandoradsalternativen tillgängliga för omc.

source: Flags that enable debugging, diagnostics, and research prototypes.
sv: Flaggor som aktiverar felsökning, diagnostik, och forskningsprototyper.

source: Flags that determine which symbolic methods are used to produce the causalized equation system.
sv: Flaggor som bestämmer vilken symbolisk metod som används för att producera det kausaliserade ekvationssystemet.

source: The command-line options available for simulation executables generated by OpenModelica.
sv: Kommandoradsalternativ tillgängliga för simuleringsprogram genererade av OpenModelica.

source: Displays option descriptions for multi-option flag <flagname>.
sv: Beskriver alternativen tillgängliga för flervalsflaggan <flagname>.

source: This help-text.
sv: Visar hjälptexten.

source: The available topics (help("topics")) are as follows:
sv: De tillgängliga ämnena (help("topics")) är följande:

source: The debug flag takes a comma-separated list of flags which are used by the compiler for debugging or experimental purposes. Flags prefixed with "-" or "no" will be disabled.
sv: debug-flaggan tar en komma-separerad lista av flaggor som används av kompilatorn för debuggning och experimentella funktioner. Flaggor med "-" eller "no" som prefix slås av.

source: The available flags are (+ are enabled by default, - are disabled):
sv: De tillgängliga flaggorna är (+ är påslagna som standard, - är avslagna):

source: Distributed under OMSC-PL and GPL, see www.openmodelica.org
sv: Distribueras under OMSC-PL och GPL, se www.openmodelica.org

source: * Examples:
sv: * Exempel:

source: omc Model.mo will produce flattened Model on standard output.
sv: omc Model.mo producerar uflatat Model på standard ut.

source: * Model.c The model C code.
sv: * Model.c Modellens C-kod.

source: * Model_functions.c The model functions C code.
sv: * Model_functions.c C-kod för funktioner.

source: * Model.makefile The makefile to compile the model.
sv: * Model.makefile Makefile för att kompilera modellen.

source: * Model_init.xml The initial values.
sv: * Model_init.xml Begynnelsevillkor.

source: omc Script.mos will run the commands from Script.mos.
sv: omc Script.mos kör kommandon från Script.mos.

source: omc Model.mo Modelica will first load the Modelica library and then produce flattened Model on standard output.
sv: omc Model.mo Modelica laddar först Modelica-biblioteket och producerar sedan en utflatat Model på standard ut.

source: omc Model1.mo Model2.mo will load both Model1.mo and Model2.mo, and produce flattened Model1 on standard output.
sv: omc Model1.mo Model2.mo laddar både Model1.mo och Model2.mo och producerar utflatad Model1 på standard ut.

source: *.mo (Modelica files)
sv: *.mo (Modelica-filer)

source: *.mos (Modelica Script files)
sv: *.mos (Modelica-skript)

source: Documentation is available in the built-in package OpenModelica.Scripting or online <https://build.openmodelica.org/Documentation/OpenModelica.Scripting.html>.
sv: Dokumentation är tillgänglig i det inbyggda paketet OpenModelica.Scripting eller online <https://build.openmodelica.org/Documentation/OpenModelica.Scripting.html>.

source: Valid options:
sv: Giltiga alternativ:

source: module = %s, log level = %s: %s
sv: module = %s, loggningsnivå = %s: %s

source: The FMU version is %s. Unknown/Unsupported FMU version.
sv: FMU-versionen är %s. Okänd/ej stödd FMU-version.

source: Error parsing the modelDescription.xml file.
sv: Kunde inte tolka modelDescription.xml.

source: Unknown result-file suffix of file '%s'
sv: Okänd resultatfil med ändelse '%s'

source: Failed to open simulation result %s: %s
sv: Misslyckades öppna simuleringsresultat %s: %s

source: Failed to open simulation result %s
sv: Misslyckades öppna simuleringsresultat %s

source: %s not found in %s
sv: %s hittades inte i %s

source: %s not defined at time %s (startTime=%s, stopTime=%s).
sv: %s är inte definierad vid tidpunkt %s (start=%s, stopp=%s).

source: %s not defined at time %s
sv: %s är ej definierad vid tidpunkt %s

source: val() not implemented for plot format: %s
sv: val() stödjer ej data-format: %s

source: Failed to read readSimulationResultSize from file: %s
sv: Misslyckades läsa storlek av simuleringsresultat från fil: %s

source: readSimulationResultSize() not implemented for plot format: %s
sv: readSimulationResultSize() stödjer ej dataformat: %s

source: readSimulationResultSize() not implemented for plot format: %s
sv: readSimulationResultSize() stödjer ej dataformat: %s

source: readDataset(...): Expected and actual dimension sizes do not match.
sv: readDataset(...): Förväntade och faktiska dimensionsstorlekar stämmer ej överens.

source: Could not read variable %s in file %s.
sv: Kunde inte läsa variabel %s i fil %s.

source: readDataSet() not implemented for plot format: %s
sv: readDataSet() stödjer ej data-format: %s

source: Get data of variable %s from file %s failed!
sv: Hämtning av data för variabel %s från fil %s misslyckades!

source: Cannot write to the difference (.csv) file!
sv: Kan inte skriva till differensfilen (.csv)!

source: Files not Equal
sv: Filerna är inte lika

source: Error compiling regular expression: %s or %s.
sv: Misslyckades med att kompilera reguljärt uttryck: %s eller %s.

source: Error opening file: %s.
sv: Fel vid öppning av fil %s.

source: File too large to fit into a MetaModelica string: %s.
sv: Filen får inte plats i en MetaModelica string: %s.

source: Error appending to file %s.
sv: Fel vid tillägg till fil %s.

source: system(%s) failed: %s
sv: system(%s) misslyckades: %s

source: Error opening file %s.
sv: Fel vid öppning av fil %s.
